graph(%0 : Float(1, 2, 960, 960, strides=[1843200, 921600, 960, 1], requires_grad=0, device=cuda:0),
      %1 : Float(1, 3, 960, 960, strides=[2764800, 921600, 960, 1], requires_grad=0, device=cuda:0),
      %2 : Float(1, 3, 960, 960, strides=[2764800, 921600, 960, 1], requires_grad=0, device=cuda:0),
      %3 : Float(1, 3, 960, 960, strides=[2764800, 921600, 960, 1], requires_grad=0, device=cuda:0),
      %4 : Float(1, 3, 960, 960, strides=[2764800, 921600, 960, 1], requires_grad=0, device=cuda:0),
      %5 : Float(1, 3, 960, 960, strides=[2764800, 921600, 960, 1], requires_grad=0, device=cuda:0),
      %6 : Float(1, 1, 960, 960, strides=[921600, 921600, 960, 1], requires_grad=0, device=cuda:0),
      %pre_feature_extraction_model.featuring.0.weight : Float(16, 15, 3, 3, strides=[135, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pre_feature_extraction_model.featuring.0.bias : Float(16, strides=[1], requires_grad=1, device=cuda:0),
      %pre_feature_extraction_model.featuring.2.weight : Float(16, 16, 3, 3, strides=[144, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pre_feature_extraction_model.featuring.2.bias : Float(16, strides=[1], requires_grad=1, device=cuda:0),
      %pre_feature_extraction_model.featuring.4.weight : Float(8, 16, 3, 3, strides=[144, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pre_feature_extraction_model.featuring.4.bias : Float(8, strides=[1], requires_grad=1, device=cuda:0),
      %pre_warp_conv.downlayer7.0.weight : Float(16, 12, 3, 3, strides=[108, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pre_warp_conv.downlayer7.0.bias : Float(16, strides=[1], requires_grad=1, device=cuda:0),
      %pre_warp_conv.downlayer7.2.weight : Float(16, 16, 3, 3, strides=[144, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pre_warp_conv.downlayer7.2.bias : Float(16, strides=[1], requires_grad=1, device=cuda:0),
      %pre_warp_conv.downlayer7_down.weight : Float(16, 16, 2, 2, strides=[64, 4, 2, 1], requires_grad=1, device=cuda:0),
      %pre_warp_conv.downlayer7_down.bias : Float(16, strides=[1], requires_grad=1, device=cuda:0),
      %pre_warp_conv.downlayer6.0.weight : Float(24, 64, 3, 3, strides=[576, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pre_warp_conv.downlayer6.0.bias : Float(24, strides=[1], requires_grad=1, device=cuda:0),
      %pre_warp_conv.downlayer6.2.weight : Float(24, 24, 3, 3, strides=[216, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pre_warp_conv.downlayer6.2.bias : Float(24, strides=[1], requires_grad=1, device=cuda:0),
      %pre_warp_conv.downlayer6_down.weight : Float(24, 24, 2, 2, strides=[96, 4, 2, 1], requires_grad=1, device=cuda:0),
      %pre_warp_conv.downlayer6_down.bias : Float(24, strides=[1], requires_grad=1, device=cuda:0),
      %pre_warp_conv.downlayer5.0.weight : Float(36, 216, 3, 3, strides=[1944, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pre_warp_conv.downlayer5.0.bias : Float(36, strides=[1], requires_grad=1, device=cuda:0),
      %pre_warp_conv.downlayer5.2.weight : Float(36, 36, 3, 3, strides=[324, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pre_warp_conv.downlayer5.2.bias : Float(36, strides=[1], requires_grad=1, device=cuda:0),
      %pre_warp_conv.downlayer5_down.weight : Float(36, 36, 2, 2, strides=[144, 4, 2, 1], requires_grad=1, device=cuda:0),
      %pre_warp_conv.downlayer5_down.bias : Float(36, strides=[1], requires_grad=1, device=cuda:0),
      %pre_warp_conv.layer0.0.weight : Float(256, 804, 3, 3, strides=[7236, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pre_warp_conv.layer0.0.bias : Float(256, strides=[1], requires_grad=1, device=cuda:0),
      %pre_warp_conv.layer0.2.weight : Float(96, 256, 3, 3, strides=[2304, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pre_warp_conv.layer0.2.bias : Float(96, strides=[1], requires_grad=1, device=cuda:0),
      %pre_warp_conv.decode5conv.0.weight : Float(24, 324, 3, 3, strides=[2916, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pre_warp_conv.decode5conv.0.bias : Float(24, strides=[1], requires_grad=1, device=cuda:0),
      %pre_warp_conv.decode5conv.2.weight : Float(36, 24, 3, 3, strides=[216, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pre_warp_conv.decode5conv.2.bias : Float(36, strides=[1], requires_grad=1, device=cuda:0),
      %pre_warp_conv.decode6conv.0.weight : Float(16, 96, 3, 3, strides=[864, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pre_warp_conv.decode6conv.0.bias : Float(16, strides=[1], requires_grad=1, device=cuda:0),
      %pre_warp_conv.decode6conv.2.weight : Float(28, 16, 3, 3, strides=[144, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pre_warp_conv.decode6conv.2.bias : Float(28, strides=[1], requires_grad=1, device=cuda:0),
      %pre_warp_conv.decode7conv.0.weight : Float(14, 44, 3, 3, strides=[396, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pre_warp_conv.decode7conv.0.bias : Float(14, strides=[1], requires_grad=1, device=cuda:0),
      %pre_warp_conv.decode7conv.0.conv_offset_mask.weight : Float(27, 44, 3, 3, strides=[396, 9, 3, 1], requires_grad=1, device=cuda:0),
      %pre_warp_conv.decode7conv.0.conv_offset_mask.bias : Float(27, strides=[1], requires_grad=1, device=cuda:0),
      %2268 : Float(4, strides=[1], requires_grad=0, device=cpu),
      %2269 : Float(4, strides=[1], requires_grad=0, device=cpu),
      %2270 : Float(4, strides=[1], requires_grad=0, device=cpu),
      %2276 : Long(5, strides=[1], requires_grad=0, device=cpu),
      %2283 : Long(6, strides=[1], requires_grad=0, device=cpu),
      %2287 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %2288 : Long(4, strides=[1], requires_grad=0, device=cpu),
      %2289 : Long(4, strides=[1], requires_grad=0, device=cpu),
      %2293 : Long(4, strides=[1], requires_grad=0, device=cpu),
      %2294 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %2295 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %2296 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %2297 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %2300 : Long(4, strides=[1], requires_grad=0, device=cpu),
      %2306 : Long(5, strides=[1], requires_grad=0, device=cpu),
      %2313 : Long(6, strides=[1], requires_grad=0, device=cpu),
      %2317 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %2318 : Long(4, strides=[1], requires_grad=0, device=cpu),
      %2319 : Long(4, strides=[1], requires_grad=0, device=cpu),
      %2323 : Long(4, strides=[1], requires_grad=0, device=cpu),
      %2324 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %2325 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %2326 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %2327 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %2330 : Long(4, strides=[1], requires_grad=0, device=cpu),
      %2336 : Long(5, strides=[1], requires_grad=0, device=cpu),
      %2343 : Long(6, strides=[1], requires_grad=0, device=cpu),
      %2347 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %2348 : Long(4, strides=[1], requires_grad=0, device=cpu),
      %2349 : Long(4, strides=[1], requires_grad=0, device=cpu),
      %2353 : Long(4, strides=[1], requires_grad=0, device=cpu),
      %2354 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %2355 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %2356 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %2357 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %2360 : Long(4, strides=[1], requires_grad=0, device=cpu),
      %2366 : Long(5, strides=[1], requires_grad=0, device=cpu),
      %2373 : Long(6, strides=[1], requires_grad=0, device=cpu),
      %2377 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %2378 : Long(4, strides=[1], requires_grad=0, device=cpu),
      %2382 : Long(4, strides=[1], requires_grad=0, device=cpu),
      %2383 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %2384 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %2385 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %2386 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %2392 : Long(5, strides=[1], requires_grad=0, device=cpu),
      %2399 : Long(6, strides=[1], requires_grad=0, device=cpu),
      %2403 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %2404 : Long(4, strides=[1], requires_grad=0, device=cpu),
      %2408 : Long(4, strides=[1], requires_grad=0, device=cpu),
      %2409 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %2410 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %2411 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %2412 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %2418 : Long(5, strides=[1], requires_grad=0, device=cpu),
      %2425 : Long(6, strides=[1], requires_grad=0, device=cpu),
      %2429 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %2430 : Long(4, strides=[1], requires_grad=0, device=cpu),
      %2434 : Long(4, strides=[1], requires_grad=0, device=cpu),
      %2435 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %2436 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %2437 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %2438 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %2444 : Long(5, strides=[1], requires_grad=0, device=cpu),
      %2451 : Long(6, strides=[1], requires_grad=0, device=cpu),
      %2455 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %2456 : Long(4, strides=[1], requires_grad=0, device=cpu),
      %2460 : Long(4, strides=[1], requires_grad=0, device=cpu),
      %2461 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %2462 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %2463 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %2464 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %2470 : Long(5, strides=[1], requires_grad=0, device=cpu),
      %2477 : Long(6, strides=[1], requires_grad=0, device=cpu),
      %2481 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %2482 : Long(4, strides=[1], requires_grad=0, device=cpu),
      %2486 : Long(4, strides=[1], requires_grad=0, device=cpu),
      %2487 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %2488 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %2489 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %2490 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %2496 : Long(5, strides=[1], requires_grad=0, device=cpu),
      %2503 : Long(6, strides=[1], requires_grad=0, device=cpu),
      %2507 : Long(1, strides=[1], requires_grad=0, device=cpu),
      %2508 : Long(4, strides=[1], requires_grad=0, device=cpu),
      %2509 : Float(4, strides=[1], requires_grad=0, device=cpu),
      %2510 : Float(4, strides=[1], requires_grad=0, device=cpu),
      %2511 : Float(requires_grad=0, device=cpu),
      %2512 : Float(requires_grad=0, device=cpu)):
  %75 : Float(1, 15, 960, 960, strides=[13824000, 921600, 960, 1], requires_grad=0, device=cuda:0) = onnx::Concat[axis=1](%6, %0, %1, %2, %3, %4) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:204:0
  %76 : Float(1, 16, 960, 960, strides=[14745600, 921600, 960, 1], requires_grad=1, device=cuda:0) = onnx::Conv[dilations=[1, 1], group=1, kernel_shape=[3, 3], pads=[1, 1, 1, 1], strides=[1, 1]](%75, %pre_feature_extraction_model.featuring.0.weight, %pre_feature_extraction_model.featuring.0.bias) # /home/wgy/anaconda3/envs/fovol/lib/python3.7/site-packages/torch/nn/modules/conv.py:443:0
  %77 : Float(1, 16, 960, 960, strides=[14745600, 921600, 960, 1], requires_grad=1, device=cuda:0) = onnx::Relu(%76) # /home/wgy/anaconda3/envs/fovol/lib/python3.7/site-packages/torch/nn/functional.py:1299:0
  %78 : Float(1, 16, 960, 960, strides=[14745600, 921600, 960, 1], requires_grad=1, device=cuda:0) = onnx::Conv[dilations=[1, 1], group=1, kernel_shape=[3, 3], pads=[1, 1, 1, 1], strides=[1, 1]](%77, %pre_feature_extraction_model.featuring.2.weight, %pre_feature_extraction_model.featuring.2.bias) # /home/wgy/anaconda3/envs/fovol/lib/python3.7/site-packages/torch/nn/modules/conv.py:443:0
  %79 : Float(1, 16, 960, 960, strides=[14745600, 921600, 960, 1], requires_grad=1, device=cuda:0) = onnx::Relu(%78) # /home/wgy/anaconda3/envs/fovol/lib/python3.7/site-packages/torch/nn/functional.py:1299:0
  %80 : Float(1, 8, 960, 960, strides=[7372800, 921600, 960, 1], requires_grad=1, device=cuda:0) = onnx::Conv[dilations=[1, 1], group=1, kernel_shape=[3, 3], pads=[1, 1, 1, 1], strides=[1, 1]](%79, %pre_feature_extraction_model.featuring.4.weight, %pre_feature_extraction_model.featuring.4.bias) # /home/wgy/anaconda3/envs/fovol/lib/python3.7/site-packages/torch/nn/modules/conv.py:443:0
  %81 : Float(1, 8, 960, 960, strides=[7372800, 921600, 960, 1], requires_grad=1, device=cuda:0) = onnx::Relu(%80) # /home/wgy/anaconda3/envs/fovol/lib/python3.7/site-packages/torch/nn/functional.py:1299:0
  %82 : Float(1, 12, 960, 960, strides=[11059200, 921600, 960, 1], requires_grad=1, device=cuda:0) = onnx::Concat[axis=1](%6, %5, %81) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:205:0
  %83 : Float(1, 48, 480, 480, strides=[11059200, 230400, 480, 1], requires_grad=1, device=cuda:0) = onnx::SpaceToDepth[blocksize=2](%82) # /home/wgy/anaconda3/envs/fovol/lib/python3.7/site-packages/torch/nn/modules/pixelshuffle.py:103:0
  %84 : Float(1, 192, 240, 240, strides=[11059200, 57600, 240, 1], requires_grad=1, device=cuda:0) = onnx::SpaceToDepth[blocksize=4](%82) # /home/wgy/anaconda3/envs/fovol/lib/python3.7/site-packages/torch/nn/modules/pixelshuffle.py:103:0
  %85 : Float(1, 768, 120, 120, strides=[11059200, 14400, 120, 1], requires_grad=1, device=cuda:0) = onnx::SpaceToDepth[blocksize=8](%82) # /home/wgy/anaconda3/envs/fovol/lib/python3.7/site-packages/torch/nn/modules/pixelshuffle.py:103:0
  %86 : Float(1, 16, 960, 960, strides=[14745600, 921600, 960, 1], requires_grad=1, device=cuda:0) = onnx::Conv[dilations=[1, 1], group=1, kernel_shape=[3, 3], pads=[1, 1, 1, 1], strides=[1, 1]](%82, %pre_warp_conv.downlayer7.0.weight, %pre_warp_conv.downlayer7.0.bias) # /home/wgy/anaconda3/envs/fovol/lib/python3.7/site-packages/torch/nn/modules/conv.py:443:0
  %87 : Float(1, 16, 960, 960, strides=[14745600, 921600, 960, 1], requires_grad=1, device=cuda:0) = onnx::Relu(%86) # /home/wgy/anaconda3/envs/fovol/lib/python3.7/site-packages/torch/nn/functional.py:1297:0
  %88 : Float(1, 16, 960, 960, strides=[14745600, 921600, 960, 1], requires_grad=1, device=cuda:0) = onnx::Conv[dilations=[1, 1], group=1, kernel_shape=[3, 3], pads=[1, 1, 1, 1], strides=[1, 1]](%87, %pre_warp_conv.downlayer7.2.weight, %pre_warp_conv.downlayer7.2.bias) # /home/wgy/anaconda3/envs/fovol/lib/python3.7/site-packages/torch/nn/modules/conv.py:443:0
  %89 : Float(1, 16, 960, 960, strides=[14745600, 921600, 960, 1], requires_grad=1, device=cuda:0) = onnx::Relu(%88) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:211:0
  %90 : Float(1, 16, 480, 480, strides=[3686400, 230400, 480, 1], requires_grad=1, device=cuda:0) = onnx::Conv[dilations=[1, 1], group=1, kernel_shape=[2, 2], pads=[0, 0, 0, 0], strides=[2, 2]](%89, %pre_warp_conv.downlayer7_down.weight, %pre_warp_conv.downlayer7_down.bias) # /home/wgy/anaconda3/envs/fovol/lib/python3.7/site-packages/torch/nn/modules/conv.py:443:0
  %91 : Float(1, 64, 480, 480, strides=[14745600, 230400, 480, 1], requires_grad=1, device=cuda:0) = onnx::Concat[axis=1](%90, %83) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:434:0
  %92 : Float(1, 24, 480, 480, strides=[5529600, 230400, 480, 1], requires_grad=1, device=cuda:0) = onnx::Conv[dilations=[1, 1], group=1, kernel_shape=[3, 3], pads=[1, 1, 1, 1], strides=[1, 1]](%91, %pre_warp_conv.downlayer6.0.weight, %pre_warp_conv.downlayer6.0.bias) # /home/wgy/anaconda3/envs/fovol/lib/python3.7/site-packages/torch/nn/modules/conv.py:443:0
  %93 : Float(1, 24, 480, 480, strides=[5529600, 230400, 480, 1], requires_grad=1, device=cuda:0) = onnx::Relu(%92) # /home/wgy/anaconda3/envs/fovol/lib/python3.7/site-packages/torch/nn/functional.py:1297:0
  %94 : Float(1, 24, 480, 480, strides=[5529600, 230400, 480, 1], requires_grad=1, device=cuda:0) = onnx::Conv[dilations=[1, 1], group=1, kernel_shape=[3, 3], pads=[1, 1, 1, 1], strides=[1, 1]](%93, %pre_warp_conv.downlayer6.2.weight, %pre_warp_conv.downlayer6.2.bias) # /home/wgy/anaconda3/envs/fovol/lib/python3.7/site-packages/torch/nn/modules/conv.py:443:0
  %95 : Float(1, 24, 480, 480, strides=[5529600, 230400, 480, 1], requires_grad=1, device=cuda:0) = onnx::Relu(%94) # /home/wgy/anaconda3/envs/fovol/lib/python3.7/site-packages/torch/nn/functional.py:1297:0
  %96 : Float(1, 24, 240, 240, strides=[1382400, 57600, 240, 1], requires_grad=1, device=cuda:0) = onnx::Conv[dilations=[1, 1], group=1, kernel_shape=[2, 2], pads=[0, 0, 0, 0], strides=[2, 2]](%95, %pre_warp_conv.downlayer6_down.weight, %pre_warp_conv.downlayer6_down.bias) # /home/wgy/anaconda3/envs/fovol/lib/python3.7/site-packages/torch/nn/modules/conv.py:443:0
  %97 : Float(1, 216, 240, 240, strides=[12441600, 57600, 240, 1], requires_grad=1, device=cuda:0) = onnx::Concat[axis=1](%96, %84) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:437:0
  %98 : Float(1, 36, 240, 240, strides=[2073600, 57600, 240, 1], requires_grad=1, device=cuda:0) = onnx::Conv[dilations=[1, 1], group=1, kernel_shape=[3, 3], pads=[1, 1, 1, 1], strides=[1, 1]](%97, %pre_warp_conv.downlayer5.0.weight, %pre_warp_conv.downlayer5.0.bias) # /home/wgy/anaconda3/envs/fovol/lib/python3.7/site-packages/torch/nn/modules/conv.py:443:0
  %99 : Float(1, 36, 240, 240, strides=[2073600, 57600, 240, 1], requires_grad=1, device=cuda:0) = onnx::Relu(%98) # /home/wgy/anaconda3/envs/fovol/lib/python3.7/site-packages/torch/nn/functional.py:1297:0
  %100 : Float(1, 36, 240, 240, strides=[2073600, 57600, 240, 1], requires_grad=1, device=cuda:0) = onnx::Conv[dilations=[1, 1], group=1, kernel_shape=[3, 3], pads=[1, 1, 1, 1], strides=[1, 1]](%99, %pre_warp_conv.downlayer5.2.weight, %pre_warp_conv.downlayer5.2.bias) # /home/wgy/anaconda3/envs/fovol/lib/python3.7/site-packages/torch/nn/modules/conv.py:443:0
  %101 : Float(1, 36, 240, 240, strides=[2073600, 57600, 240, 1], requires_grad=1, device=cuda:0) = onnx::Relu(%100) # /home/wgy/anaconda3/envs/fovol/lib/python3.7/site-packages/torch/nn/functional.py:1297:0
  %102 : Float(1, 36, 120, 120, strides=[518400, 14400, 120, 1], requires_grad=1, device=cuda:0) = onnx::Conv[dilations=[1, 1], group=1, kernel_shape=[2, 2], pads=[0, 0, 0, 0], strides=[2, 2]](%101, %pre_warp_conv.downlayer5_down.weight, %pre_warp_conv.downlayer5_down.bias) # /home/wgy/anaconda3/envs/fovol/lib/python3.7/site-packages/torch/nn/modules/conv.py:443:0
  %103 : Float(1, 804, 120, 120, strides=[11577600, 14400, 120, 1], requires_grad=1, device=cuda:0) = onnx::Concat[axis=1](%102, %85) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:440:0
  %104 : Float(1, 256, 120, 120, strides=[3686400, 14400, 120, 1], requires_grad=1, device=cuda:0) = onnx::Conv[dilations=[1, 1], group=1, kernel_shape=[3, 3], pads=[1, 1, 1, 1], strides=[1, 1]](%103, %pre_warp_conv.layer0.0.weight, %pre_warp_conv.layer0.0.bias) # /home/wgy/anaconda3/envs/fovol/lib/python3.7/site-packages/torch/nn/modules/conv.py:443:0
  %105 : Float(1, 256, 120, 120, strides=[3686400, 14400, 120, 1], requires_grad=1, device=cuda:0) = onnx::Relu(%104) # /home/wgy/anaconda3/envs/fovol/lib/python3.7/site-packages/torch/nn/functional.py:1297:0
  %106 : Float(1, 96, 120, 120, strides=[1382400, 14400, 120, 1], requires_grad=1, device=cuda:0) = onnx::Conv[dilations=[1, 1], group=1, kernel_shape=[3, 3], pads=[1, 1, 1, 1], strides=[1, 1]](%105, %pre_warp_conv.layer0.2.weight, %pre_warp_conv.layer0.2.bias) # /home/wgy/anaconda3/envs/fovol/lib/python3.7/site-packages/torch/nn/modules/conv.py:443:0
  %107 : Float(1, 96, 120, 120, strides=[1382400, 14400, 120, 1], requires_grad=1, device=cuda:0) = onnx::Relu(%106) # /home/wgy/anaconda3/envs/fovol/lib/python3.7/site-packages/torch/nn/functional.py:1297:0
  %111 : Float(0, strides=[1], device=cpu) = onnx::Constant[value=[ CPUFloatType{0} ]]()
  %112 : Float(1, 96, 240, 240, strides=[5529600, 57600, 240, 1], requires_grad=1, device=cuda:0) = onnx::Resize[coordinate_transformation_mode="align_corners", cubic_coeff_a=-0.75, mode="linear", nearest_mode="floor"](%107, %111, %2268) # /home/wgy/anaconda3/envs/fovol/lib/python3.7/site-packages/torch/nn/functional.py:3731:0
  %113 : Float(1, 324, 240, 240, strides=[18662400, 57600, 240, 1], requires_grad=1, device=cuda:0) = onnx::Concat[axis=1](%112, %101, %84) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:443:0
  %114 : Float(1, 24, 240, 240, strides=[1382400, 57600, 240, 1], requires_grad=1, device=cuda:0) = onnx::Conv[dilations=[1, 1], group=1, kernel_shape=[3, 3], pads=[1, 1, 1, 1], strides=[1, 1]](%113, %pre_warp_conv.decode5conv.0.weight, %pre_warp_conv.decode5conv.0.bias) # /home/wgy/anaconda3/envs/fovol/lib/python3.7/site-packages/torch/nn/modules/conv.py:443:0
  %115 : Float(1, 24, 240, 240, strides=[1382400, 57600, 240, 1], requires_grad=1, device=cuda:0) = onnx::Relu(%114) # /home/wgy/anaconda3/envs/fovol/lib/python3.7/site-packages/torch/nn/functional.py:1297:0
  %116 : Float(1, 36, 240, 240, strides=[2073600, 57600, 240, 1], requires_grad=1, device=cuda:0) = onnx::Conv[dilations=[1, 1], group=1, kernel_shape=[3, 3], pads=[1, 1, 1, 1], strides=[1, 1]](%115, %pre_warp_conv.decode5conv.2.weight, %pre_warp_conv.decode5conv.2.bias) # /home/wgy/anaconda3/envs/fovol/lib/python3.7/site-packages/torch/nn/modules/conv.py:443:0
  %117 : Float(1, 36, 240, 240, strides=[2073600, 57600, 240, 1], requires_grad=1, device=cuda:0) = onnx::Elu[alpha=1.](%116) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:454:0
  %118 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={1}]()
  %119 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={0}]()
  %120 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={24}]()
  %121 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={1}]()
  %122 : Float(1, 24, 240, 240, strides=[2073600, 57600, 240, 1], requires_grad=1, device=cuda:0) = onnx::Slice(%117, %119, %120, %118, %121) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:445:0
  %126 : Float(0, strides=[1], device=cpu) = onnx::Constant[value=[ CPUFloatType{0} ]]()
  %127 : Float(1, 24, 480, 480, strides=[5529600, 230400, 480, 1], requires_grad=1, device=cuda:0) = onnx::Resize[coordinate_transformation_mode="align_corners", cubic_coeff_a=-0.75, mode="linear", nearest_mode="floor"](%122, %126, %2269) # /home/wgy/anaconda3/envs/fovol/lib/python3.7/site-packages/torch/nn/functional.py:3731:0
  %128 : Float(1, 96, 480, 480, strides=[22118400, 230400, 480, 1], requires_grad=1, device=cuda:0) = onnx::Concat[axis=1](%127, %95, %83) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:446:0
  %129 : Float(1, 16, 480, 480, strides=[3686400, 230400, 480, 1], requires_grad=1, device=cuda:0) = onnx::Conv[dilations=[1, 1], group=1, kernel_shape=[3, 3], pads=[1, 1, 1, 1], strides=[1, 1]](%128, %pre_warp_conv.decode6conv.0.weight, %pre_warp_conv.decode6conv.0.bias) # /home/wgy/anaconda3/envs/fovol/lib/python3.7/site-packages/torch/nn/modules/conv.py:443:0
  %130 : Float(1, 16, 480, 480, strides=[3686400, 230400, 480, 1], requires_grad=1, device=cuda:0) = onnx::Relu(%129) # /home/wgy/anaconda3/envs/fovol/lib/python3.7/site-packages/torch/nn/functional.py:1297:0
  %131 : Float(1, 28, 480, 480, strides=[6451200, 230400, 480, 1], requires_grad=1, device=cuda:0) = onnx::Conv[dilations=[1, 1], group=1, kernel_shape=[3, 3], pads=[1, 1, 1, 1], strides=[1, 1]](%130, %pre_warp_conv.decode6conv.2.weight, %pre_warp_conv.decode6conv.2.bias) # /home/wgy/anaconda3/envs/fovol/lib/python3.7/site-packages/torch/nn/modules/conv.py:443:0
  %132 : Float(1, 28, 480, 480, strides=[6451200, 230400, 480, 1], requires_grad=1, device=cuda:0) = onnx::Elu[alpha=1.](%131) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:454:0
  %133 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={1}]()
  %134 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={0}]()
  %135 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={16}]()
  %136 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={1}]()
  %137 : Float(1, 16, 480, 480, strides=[6451200, 230400, 480, 1], requires_grad=1, device=cuda:0) = onnx::Slice(%132, %134, %135, %133, %136) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:448:0
  %141 : Float(0, strides=[1], device=cpu) = onnx::Constant[value=[ CPUFloatType{0} ]]()
  %142 : Float(1, 16, 960, 960, strides=[14745600, 921600, 960, 1], requires_grad=1, device=cuda:0) = onnx::Resize[coordinate_transformation_mode="align_corners", cubic_coeff_a=-0.75, mode="linear", nearest_mode="floor"](%137, %141, %2270) # /home/wgy/anaconda3/envs/fovol/lib/python3.7/site-packages/torch/nn/functional.py:3731:0
  %143 : Float(1, 44, 960, 960, strides=[40550400, 921600, 960, 1], requires_grad=1, device=cuda:0) = onnx::Concat[axis=1](%142, %89, %82) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:449:0
  %144 : Float(1, 27, 960, 960, strides=[24883200, 921600, 960, 1], requires_grad=1, device=cuda:0) = onnx::Conv[dilations=[1, 1], group=1, kernel_shape=[3, 3], pads=[1, 1, 1, 1], strides=[1, 1]](%143, %pre_warp_conv.decode7conv.0.conv_offset_mask.weight, %pre_warp_conv.decode7conv.0.conv_offset_mask.bias) # /home/wgy/anaconda3/envs/fovol/lib/python3.7/site-packages/torch/nn/modules/conv.py:443:0
  %145 : Long(4, strides=[1], device=cpu) = onnx::Shape(%144)
  %146 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={1}]()
  %147 : Long(1, strides=[1], device=cpu) = onnx::Gather[axis=0](%145, %146)
  %148 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={0}]()
  %149 : Long(1, strides=[1], requires_grad=0, device=cpu) = onnx::Constant[value={2}]()
  %150 : Long(1, strides=[1], device=cpu) = onnx::Add(%147, %149)
  %151 : Long(1, strides=[1], requires_grad=0, device=cpu) = onnx::Constant[value={3}]()
  %152 : Long(1, strides=[1], device=cpu) = onnx::Div(%150, %151)
  %153 : Long(1, strides=[1], requires_grad=0, device=cpu) = onnx::Constant[value={1}]()
  %154 : Long(1, strides=[1], device=cpu) = onnx::Mul(%152, %153)
  %155 : Float(1, 9, 960, 960, strides=[24883200, 921600, 960, 1], requires_grad=1, device=cuda:0) = onnx::Slice(%144, %148, %154, %146)
  %156 : Long(1, strides=[1], requires_grad=0, device=cpu) = onnx::Constant[value={2}]()
  %157 : Long(1, strides=[1], device=cpu) = onnx::Mul(%152, %156)
  %158 : Float(1, 9, 960, 960, strides=[24883200, 921600, 960, 1], requires_grad=1, device=cuda:0) = onnx::Slice(%144, %154, %157, %146)
  %159 : Long(1, strides=[1], requires_grad=0, device=cpu) = onnx::Constant[value={3}]()
  %160 : Long(1, strides=[1], device=cpu) = onnx::Mul(%152, %159)
  %161 : Float(1, 9, 960, 960, strides=[24883200, 921600, 960, 1], requires_grad=1, device=cuda:0) = onnx::Slice(%144, %157, %160, %146)
  %162 : Float(1, 18, 960, 960, strides=[16588800, 921600, 960, 1], requires_grad=1, device=cuda:0) = onnx::Concat[axis=1](%155, %158) # /home/wgy/anaconda3/envs/fovol/lib/python3.7/site-packages/DCN-1.0-py3.7-linux-x86_64.egg/modules/modulated_deform_conv.py:93:0
  %163 : Float(1, 9, 960, 960, strides=[8294400, 921600, 960, 1], requires_grad=1, device=cuda:0) = onnx::Sigmoid(%161) # /home/wgy/anaconda3/envs/fovol/lib/python3.7/site-packages/DCN-1.0-py3.7-linux-x86_64.egg/modules/modulated_deform_conv.py:94:0
  %input : Float(*, *, *, *, strides=[12902400, 921600, 960, 1], requires_grad=1, device=cuda:0) = ^ModulatedDeformConvFunction((1, 1), (1, 1), (1, 1), 1, 1, 64)(%143, %162, %163, %pre_warp_conv.decode7conv.0.weight, %pre_warp_conv.decode7conv.0.bias) # /home/wgy/anaconda3/envs/fovol/lib/python3.7/site-packages/DCN-1.0-py3.7-linux-x86_64.egg/modules/modulated_deform_conv.py:103:0
  %165 : Float(*, *, *, *, strides=[12902400, 921600, 960, 1], requires_grad=1, device=cuda:0) = onnx::Elu[alpha=1.](%input) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:228:0
  %166 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={1}]()
  %167 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={33}]()
  %168 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={36}]()
  %169 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={1}]()
  %170 : Float(1, 3, 240, 240, strides=[2073600, 57600, 240, 1], requires_grad=1, device=cuda:0) = onnx::Slice(%117, %167, %168, %166, %169) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:215:0
  %171 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={1}]()
  %172 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={25}]()
  %173 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={28}]()
  %174 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={1}]()
  %175 : Float(1, 3, 480, 480, strides=[6451200, 230400, 480, 1], requires_grad=1, device=cuda:0) = onnx::Slice(%132, %172, %173, %171, %174) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:216:0
  %176 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={1}]()
  %177 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={24}]()
  %178 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={33}]()
  %179 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={1}]()
  %180 : Float(1, 9, 240, 240, strides=[2073600, 57600, 240, 1], requires_grad=1, device=cuda:0) = onnx::Slice(%117, %177, %178, %176, %179) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:454:0
  %181 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={1}]()
  %182 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={16}]()
  %183 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={25}]()
  %184 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={1}]()
  %185 : Float(1, 9, 480, 480, strides=[6451200, 230400, 480, 1], requires_grad=1, device=cuda:0) = onnx::Slice(%132, %182, %183, %181, %184) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:454:0
  %186 : Float(1, 3, 240, 240, strides=[2073600, 57600, 240, 1], requires_grad=0, device=cuda:0) = onnx::Constant[value=<Tensor>]() # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:215:0
  %187 : Float(1, 3, 480, 480, strides=[6451200, 230400, 480, 1], requires_grad=0, device=cuda:0) = onnx::Constant[value=<Tensor>]() # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:216:0
  %188 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={1}]()
  %189 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={0}]()
  %190 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={9}]()
  %191 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={1}]()
  %192 : Float(*, *, *, *, strides=[12902400, 921600, 960, 1], requires_grad=1, device=cuda:0) = onnx::Slice(%165, %189, %190, %188, %191) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:209:0
  %193 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={1}]()
  %194 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={0}]()
  %195 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={3}]()
  %196 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={1}]()
  %197 : Float(1, 3, 960, 960, strides=[14745600, 921600, 960, 1], requires_grad=1, device=cuda:0) = onnx::Slice(%89, %194, %195, %193, %196) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:217:0
  %198 : Float(1, 3, 960, 960, strides=[14745600, 921600, 960, 1], requires_grad=0, device=cuda:0) = onnx::Constant[value=<Tensor>]() # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:217:0
  %199 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={1}]()
  %200 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={0}]()
  %201 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={1}]()
  %202 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={1}]()
  %203 : Float(1, 1, 240, 240, strides=[2073600, 57600, 240, 1], requires_grad=1, device=cuda:0) = onnx::Slice(%170, %200, %201, %199, %202) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:215:0
  %215 : Float(1, 1, 1, 240, 240, strides=[57600, 57600, 57600, 240, 1], requires_grad=1, device=cuda:0) = onnx::Reshape(%203, %2276) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:920:0
  %226 : Float(1, 1, 9, 1, 240, 240, strides=[518400, 518400, 57600, 57600, 240, 1], requires_grad=1, device=cuda:0) = onnx::Reshape(%180, %2283) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:897:0
  %227 : Float(1, 1, 9, 1, 240, 240, strides=[518400, 518400, 57600, 57600, 240, 1], requires_grad=1, device=cuda:0) = onnx::Exp(%226) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:900:0
  %228 : Float(1, 1, 1, 1, 240, 240, strides=[57600, 57600, 57600, 57600, 240, 1], requires_grad=1, device=cuda:0) = onnx::ReduceSum[axes=[2], keepdims=1](%227) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:901:0
  %229 : Float(1, 1, 9, 1, 240, 240, strides=[518400, 518400, 57600, 57600, 240, 1], requires_grad=1, device=cuda:0) = onnx::Div(%227, %228) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:902:0
  %239 : Long(6, device=cpu) = onnx::ConstantOfShape[value={0}](%2287)
  %240 : Long(10, strides=[1], device=cpu) = onnx::Concat[axis=0](%2288, %239)
  %241 : Long(2, strides=[1], device=cpu) = onnx::Constant[value=-1  2 [ CPULongType{2} ]]()
  %242 : Long(5, 2, strides=[2, 1], device=cpu) = onnx::Reshape(%240, %241)
  %243 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={0}]()
  %244 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={-1}]()
  %245 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={-9223372036854775807}]()
  %246 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={-1}]()
  %247 : Long(5, 2, strides=[2, 1], device=cpu) = onnx::Slice(%242, %244, %245, %243, %246)
  %248 : Long(2, 5, strides=[5, 1], device=cpu) = onnx::Transpose[perm=[1, 0]](%247)
  %249 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={-1}]()
  %250 : Long(10, strides=[1], device=cpu) = onnx::Reshape(%248, %249)
  %251 : Long(10, strides=[1], device=cpu) = onnx::Cast[to=7](%250)
  %252 : Float(device=cpu) = onnx::Constant[value={0}]()
  %253 : Float(*, *, *, *, *, strides=[58564, 58564, 58564, 242, 1], requires_grad=1, device=cuda:0) = onnx::Pad[mode="constant"](%215, %251, %252) # /home/wgy/anaconda3/envs/fovol/lib/python3.7/site-packages/torch/nn/functional.py:4174:0
  %254 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={3}]()
  %255 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={0}]()
  %256 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={240}]()
  %257 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={1}]()
  %258 : Float(*, *, *, *, *, strides=[58564, 58564, 58564, 242, 1], requires_grad=1, device=cuda:0) = onnx::Slice(%253, %255, %256, %254, %257) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:935:0
  %259 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={4}]()
  %260 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={0}]()
  %261 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={240}]()
  %262 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={1}]()
  %263 : Float(*, *, *, *, *, strides=[58564, 58564, 58564, 242, 1], requires_grad=1, device=cuda:0) = onnx::Slice(%258, %260, %261, %259, %262) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:935:0
  %264 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={3}]()
  %265 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={0}]()
  %266 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={240}]()
  %267 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={1}]()
  %268 : Float(*, *, *, *, *, strides=[58564, 58564, 58564, 242, 1], requires_grad=1, device=cuda:0) = onnx::Slice(%253, %265, %266, %264, %267) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:935:0
  %269 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={4}]()
  %270 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={1}]()
  %271 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={241}]()
  %272 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={1}]()
  %273 : Float(*, *, *, *, *, strides=[58564, 58564, 58564, 242, 1], requires_grad=1, device=cuda:0) = onnx::Slice(%268, %270, %271, %269, %272) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:935:0
  %274 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={3}]()
  %275 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={0}]()
  %276 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={240}]()
  %277 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={1}]()
  %278 : Float(*, *, *, *, *, strides=[58564, 58564, 58564, 242, 1], requires_grad=1, device=cuda:0) = onnx::Slice(%253, %275, %276, %274, %277) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:935:0
  %279 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={4}]()
  %280 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={2}]()
  %281 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={242}]()
  %282 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={1}]()
  %283 : Float(*, *, *, *, *, strides=[58564, 58564, 58564, 242, 1], requires_grad=1, device=cuda:0) = onnx::Slice(%278, %280, %281, %279, %282) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:935:0
  %284 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={3}]()
  %285 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={1}]()
  %286 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={241}]()
  %287 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={1}]()
  %288 : Float(*, *, *, *, *, strides=[58564, 58564, 58564, 242, 1], requires_grad=1, device=cuda:0) = onnx::Slice(%253, %285, %286, %284, %287) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:935:0
  %289 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={4}]()
  %290 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={0}]()
  %291 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={240}]()
  %292 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={1}]()
  %293 : Float(*, *, *, *, *, strides=[58564, 58564, 58564, 242, 1], requires_grad=1, device=cuda:0) = onnx::Slice(%288, %290, %291, %289, %292) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:935:0
  %294 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={3}]()
  %295 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={1}]()
  %296 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={241}]()
  %297 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={1}]()
  %298 : Float(*, *, *, *, *, strides=[58564, 58564, 58564, 242, 1], requires_grad=1, device=cuda:0) = onnx::Slice(%253, %295, %296, %294, %297) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:935:0
  %299 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={4}]()
  %300 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={1}]()
  %301 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={241}]()
  %302 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={1}]()
  %303 : Float(*, *, *, *, *, strides=[58564, 58564, 58564, 242, 1], requires_grad=1, device=cuda:0) = onnx::Slice(%298, %300, %301, %299, %302) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:935:0
  %304 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={3}]()
  %305 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={1}]()
  %306 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={241}]()
  %307 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={1}]()
  %308 : Float(*, *, *, *, *, strides=[58564, 58564, 58564, 242, 1], requires_grad=1, device=cuda:0) = onnx::Slice(%253, %305, %306, %304, %307) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:935:0
  %309 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={4}]()
  %310 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={2}]()
  %311 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={242}]()
  %312 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={1}]()
  %313 : Float(*, *, *, *, *, strides=[58564, 58564, 58564, 242, 1], requires_grad=1, device=cuda:0) = onnx::Slice(%308, %310, %311, %309, %312) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:935:0
  %314 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={3}]()
  %315 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={2}]()
  %316 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={242}]()
  %317 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={1}]()
  %318 : Float(*, *, *, *, *, strides=[58564, 58564, 58564, 242, 1], requires_grad=1, device=cuda:0) = onnx::Slice(%253, %315, %316, %314, %317) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:935:0
  %319 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={4}]()
  %320 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={0}]()
  %321 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={240}]()
  %322 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={1}]()
  %323 : Float(*, *, *, *, *, strides=[58564, 58564, 58564, 242, 1], requires_grad=1, device=cuda:0) = onnx::Slice(%318, %320, %321, %319, %322) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:935:0
  %324 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={3}]()
  %325 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={2}]()
  %326 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={242}]()
  %327 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={1}]()
  %328 : Float(*, *, *, *, *, strides=[58564, 58564, 58564, 242, 1], requires_grad=1, device=cuda:0) = onnx::Slice(%253, %325, %326, %324, %327) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:935:0
  %329 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={4}]()
  %330 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={1}]()
  %331 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={241}]()
  %332 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={1}]()
  %333 : Float(*, *, *, *, *, strides=[58564, 58564, 58564, 242, 1], requires_grad=1, device=cuda:0) = onnx::Slice(%328, %330, %331, %329, %332) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:935:0
  %334 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={3}]()
  %335 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={2}]()
  %336 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={242}]()
  %337 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={1}]()
  %338 : Float(*, *, *, *, *, strides=[58564, 58564, 58564, 242, 1], requires_grad=1, device=cuda:0) = onnx::Slice(%253, %335, %336, %334, %337) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:935:0
  %339 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={4}]()
  %340 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={2}]()
  %341 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={242}]()
  %342 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={1}]()
  %343 : Float(*, *, *, *, *, strides=[58564, 58564, 58564, 242, 1], requires_grad=1, device=cuda:0) = onnx::Slice(%338, %340, %341, %339, %342) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:935:0
  %344 : Float(*, *, 1, *, *, *, device=cpu) = onnx::Unsqueeze[axes=[2]](%263)
  %345 : Float(*, *, 1, *, *, *, device=cpu) = onnx::Unsqueeze[axes=[2]](%273)
  %346 : Float(*, *, 1, *, *, *, device=cpu) = onnx::Unsqueeze[axes=[2]](%283)
  %347 : Float(*, *, 1, *, *, *, device=cpu) = onnx::Unsqueeze[axes=[2]](%293)
  %348 : Float(*, *, 1, *, *, *, device=cpu) = onnx::Unsqueeze[axes=[2]](%303)
  %349 : Float(*, *, 1, *, *, *, device=cpu) = onnx::Unsqueeze[axes=[2]](%313)
  %350 : Float(*, *, 1, *, *, *, device=cpu) = onnx::Unsqueeze[axes=[2]](%323)
  %351 : Float(*, *, 1, *, *, *, device=cpu) = onnx::Unsqueeze[axes=[2]](%333)
  %352 : Float(*, *, 1, *, *, *, device=cpu) = onnx::Unsqueeze[axes=[2]](%343)
  %353 : Float(*, *, 9, *, *, *, strides=[518400, 518400, 57600, 57600, 240, 1], requires_grad=1, device=cuda:0) = onnx::Concat[axis=2](%344, %345, %346, %347, %348, %349, %350, %351, %352) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:937:0
  %354 : Float(*, *, 9, *, *, *, strides=[518400, 518400, 57600, 57600, 240, 1], requires_grad=1, device=cuda:0) = onnx::Mul(%229, %353) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:939:0
  %355 : Float(*, *, *, *, *, strides=[57600, 57600, 57600, 240, 1], requires_grad=1, device=cuda:0) = onnx::ReduceSum[axes=[2], keepdims=0](%354) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:939:0
  %356 : Float(1, *, *, *, *, *, device=cpu) = onnx::Unsqueeze[axes=[0]](%355)
  %357 : Float(1, *, *, *, *, *, strides=[57600, 57600, 57600, 57600, 240, 1], requires_grad=1, device=cuda:0) = onnx::Concat[axis=0](%356) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:941:0
  %358 : Float(*, *, *, *, *, strides=[57600, 57600, 57600, 240, 1], requires_grad=1, device=cuda:0) = onnx::ReduceMean[axes=[0], keepdims=0](%357) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:942:0
  %359 : Float(*, *, *, *, strides=[57600, 57600, 240, 1], requires_grad=1, device=cuda:0) = onnx::ReduceMean[axes=[1], keepdims=0](%358) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:943:0
  %362 : Float(*, *, *, *, strides=[57600, 57600, 240, 1], requires_grad=1, device=cuda:0) = onnx::Expand(%359, %2289) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:215:0
  %363 : Long(240, strides=[1], requires_grad=0, device=cpu) = onnx::Constant[value=<Tensor>]()
  %364 : Long(1, 1, 1, 1, strides=[1, 1, 1, 1], requires_grad=0, device=cpu) = onnx::Constant[value={0}]()
  %365 : Long(1, 1, 1, strides=[1, 1, 1], requires_grad=0, device=cpu) = onnx::Constant[value={0}]()
  %366 : Long(240, 1, strides=[1, 1], requires_grad=0, device=cpu) = onnx::Constant[value=<Tensor>]()
  %376 : Long(4, device=cpu) = onnx::ConstantOfShape[value={1}](%2294)
  %377 : Long(requires_grad=0, device=cpu) = onnx::Constant[value={-1}]()
  %378 : Long(4, strides=[1], device=cpu) = onnx::Mul(%376, %377)
  %379 : Bool(4, strides=[1], device=cpu) = onnx::Equal(%2293, %378)
  %380 : Long(4, strides=[1], device=cpu) = onnx::Where(%379, %376, %2293)
  %381 : Long(1, 1, 240, 240, device=cpu) = onnx::Expand(%364, %380)
  %382 : Long(1, 1, 240, 240, 1, strides=[57600, 57600, 240, 1, 1], device=cpu) = onnx::Unsqueeze[axes=[-1]](%381)
  %384 : Long(4, device=cpu) = onnx::ConstantOfShape[value={1}](%2295)
  %385 : Long(requires_grad=0, device=cpu) = onnx::Constant[value={-1}]()
  %386 : Long(4, strides=[1], device=cpu) = onnx::Mul(%384, %385)
  %387 : Bool(4, strides=[1], device=cpu) = onnx::Equal(%2293, %386)
  %388 : Long(4, strides=[1], device=cpu) = onnx::Where(%387, %384, %2293)
  %389 : Long(1, 1, 240, 240, device=cpu) = onnx::Expand(%365, %388)
  %390 : Long(1, 1, 240, 240, 1, strides=[57600, 57600, 240, 1, 1], device=cpu) = onnx::Unsqueeze[axes=[-1]](%389)
  %392 : Long(4, device=cpu) = onnx::ConstantOfShape[value={1}](%2296)
  %393 : Long(requires_grad=0, device=cpu) = onnx::Constant[value={-1}]()
  %394 : Long(4, strides=[1], device=cpu) = onnx::Mul(%392, %393)
  %395 : Bool(4, strides=[1], device=cpu) = onnx::Equal(%2293, %394)
  %396 : Long(4, strides=[1], device=cpu) = onnx::Where(%395, %392, %2293)
  %397 : Long(1, 1, 240, 240, device=cpu) = onnx::Expand(%366, %396)
  %398 : Long(1, 1, 240, 240, 1, strides=[57600, 57600, 240, 1, 1], device=cpu) = onnx::Unsqueeze[axes=[-1]](%397)
  %400 : Long(4, device=cpu) = onnx::ConstantOfShape[value={1}](%2297)
  %401 : Long(requires_grad=0, device=cpu) = onnx::Constant[value={-1}]()
  %402 : Long(4, strides=[1], device=cpu) = onnx::Mul(%400, %401)
  %403 : Bool(4, strides=[1], device=cpu) = onnx::Equal(%2293, %402)
  %404 : Long(4, strides=[1], device=cpu) = onnx::Where(%403, %400, %2293)
  %405 : Long(1, 1, 240, 240, device=cpu) = onnx::Expand(%363, %404)
  %406 : Long(1, 1, 240, 240, 1, strides=[57600, 57600, 240, 1, 1], device=cpu) = onnx::Unsqueeze[axes=[-1]](%405)
  %407 : Long(1, 1, 240, 240, 4, strides=[230400, 230400, 960, 4, 1], device=cpu) = onnx::Concat[axis=-1](%382, %390, %398, %406)
  %414 : Float(1, 1, 240, 240, device=cpu) = onnx::Reshape(%362, %2300)
  %415 : Float(1, 3, 240, 240, strides=[2073600, 57600, 240, 1], requires_grad=1, device=cuda:0) = onnx::ScatterND(%186, %407, %414) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:215:0
  %416 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={1}]()
  %417 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={0}]()
  %418 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={1}]()
  %419 : Long(1, strides=[1], device=cpu) = onnx::Constant[value={1}]()
  %420 : Float(1, 1, 480, 480, strides=[6451200, 230400, 480, 1], requires_grad=1, device=cuda:0) = onnx::Slice(%175, %417, %418, %416, %419) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:216:0
  %432 : Float(1, 1, 1, 480, 480, strides=[230400, 230400, 230400, 480, 1], requires_grad=1, device=cuda:0) = onnx::Reshape(%420, %2306) # /home/wgy/files/DGaze_and_Recon/high_fmv/tmp/recon_test/model.py:920:0
